import React from 'react';

const About = () => (
  <div className="flex flex-col justify-center items-center mt-[7pc] p-6 lg:p-0 lg:flex-row ">
    <div className="  dark:text-blck-200 text-bl rounded-5xl border-7 border-black-800 rounded-md overflow-hidden p-6 w-full lg:w-[83%] lg:m-2 lg:p-6 lg:bg-center relative">
      <h1 className="text-blck text-lg font-bold mb-10 text-center text-[35px] leading-10">भगवद गीता के बारे में</h1>
      <p className="mb-4">भगवद गीता, जिसे गीता के नाम से भी जाना जाता है -  &quot;भगवान का गीत&quot; किसी के जीवन के लिए एक व्यावहारिक मार्गदर्शिका है जो व्यक्ति को अपने जीवन को फिर से व्यवस्थित करने, आंतरिक शांति प्राप्त करने और सर्वोच्च भगवान (परम वास्तविकता) तक पहुंचने के लिए मार्गदर्शन करती है। यह संस्कृत में 700 श्लोकों का पाठ है जिसमें महाभारत के भीष्म-पर्व खंड में अध्याय 23 से 40 तक शामिल हैं।</p>
      <p className="mb-4">भगवद गीता एक अलौकिक रूप से प्रतिभाशाली योद्धा अर्जुन और उनके मार्गदर्शक और सारथी भगवान कृष्ण के बीच कुरुक्षेत्र के युद्ध के मैदान पर एक संवाद है। जैसे ही दोनों सेनाएँ युद्ध के लिए तैयार खड़ी थीं, शक्तिशाली योद्धा अर्जुन, दोनों पक्षों के योद्धाओं को देखकर अपने रिश्तेदारों और दोस्तों को खोने के डर और अपने ही रिश्तेदारों की हत्या के परिणामस्वरूप होने वाले पापों के कारण दुःख और करुणा से अभिभूत हो गए। इसलिए, वह समाधान की तलाश में भगवान कृष्ण के सामने आत्मसमर्पण कर देता है।</p>
      <p className="mb-4"> 18 अध्यायों से अधिक, गीता में जीवन, भावनाओं और महत्वाकांक्षाओं का गहन विश्लेषण, ज्ञान, भक्ति, कर्म और राज सहित विभिन्न प्रकार के योग की चर्चा, स्वयं और भौतिक शरीर के बीच अंतर और साथ ही जीवन के अंतिम उद्देश्य का रहस्योद्घाटन शामिल है।</p>
    </div>
  </div>

);
export default About;
